Repository: komradkat/VoteWise2
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fil

source: My Profile
fil: Aking Profile

source: Voting History
fil: Kasaysayan ng Pagboto

source: Notifications
fil: Mga Abiso

source: Account Settings
fil: Mga Setting ng Account

source: Security
fil: Seguridad

source: Help & Support
fil: Tulong at Suporta

source: You're Ready to Vote!
fil: Handa Ka Nang Bumoto!

source: Voting Not Available
fil: Hindi Magagamit ang Pagboto

source: Your account is verified and eligible to participate in elections.
fil: Ang iyong account ay beripikado at kwalipikadong lumahok sa mga halalan.

source: Please contact the administrator to verify your account.
fil: Mangyaring makipag-ugnayan sa administrator upang ma-verify ang iyong account.

source: View Elections
fil: Tingnan ang mga Halalan

source: Voting Status
fil: Katayuan ng Pagboto

source: Eligible
fil: Kwalipikado

source: Not Eligible
fil: Hindi Kwalipikado

source: Elections Participated
fil: Mga Nilahukang Halalan

source: Course & Year
fil: Kurso at Taon

source: Profile Information
fil: Impormasyon ng Profile

source: Full Name
fil: Buong Pangalan

source: Account Information
fil: Impormasyon ng Account

source: Student Information
fil: Impormasyon ng Mag-aaral

source: Save Changes
fil: I-save ang mga Pagbabago

source: Voting History (Receipts)
fil: Kasaysayan ng Pagboto (Mga Resibo)

source: Election
fil: Halalan

source: Date Voted
fil: Petsa ng Pagboto

source: Status
fil: Katayuan

source: Verified
fil: Beripikado

source: Your individual choices are encrypted for privacy. You can verify your participation using the Ballot ID above.
fil: Ang iyong mga indibidwal na pagpipilian ay naka-encrypt para sa privacy. Maaari mong i-verify ang iyong paglahok gamit ang Ballot ID sa itaas.

source: You haven't cast any votes yet.
fil: Wala ka pang naiboboto.

source: No new notifications at this time.
fil: Walang bagong abiso sa ngayon.

source: Preferences
fil: Mga Kagustuhan

source: Email Notifications
fil: Mga Abiso sa Email

source: Receive email updates about new elections and results
fil: Makatanggap ng mga update sa email tungkol sa mga bagong halalan at resulta

source: Enable email notifications
fil: Paganahin ang mga abiso sa email

source: Language
fil: Wika

source: Choose your preferred language for the interface
fil: Piliin ang iyong gustong wika para sa interface

source: English
fil: Ingles

source: Change Password
fil: Palitan ang Password

source: Current Password
fil: Kasalukuyang Password

source: Enter current password
fil: Ilagay ang kasalukuyang password

source: New Password
fil: Bagong Password

source: Enter new password
fil: Ilagay ang bagong password

source: Confirm New Password
fil: Kumpirmahin ang Bagong Password

source: Confirm new password
fil: Kumpirmahin ang bagong password

source: Update Password
fil: I-update ang Password

source: Frequently Asked Questions
fil: Mga Madalas Itanong

source: How do I vote?
fil: Paano ako boboto?

source: Navigate to the Elections page from the header menu, select an active election, and follow the voting instructions.
fil: Pumunta sa pahina ng Mga Halalan mula sa menu ng header, pumili ng aktibong halalan, at sundin ang mga tagubilin sa pagboto.

source: Can I change my vote?
fil: Maaari ko bang baguhin ang aking boto?

source: No, once submitted, votes are final and cannot be changed to ensure election integrity.
fil: Hindi, kapag naisumite na, ang mga boto ay pinal na at hindi na mababago upang matiyak ang integridad ng halalan.

source: How do I verify my vote?
fil: Paano ko ma-verify ang aking boto?

source: Check your Voting History tab for your ballot ID, which serves as proof of participation.
fil: Tingnan ang iyong tab ng Kasaysayan ng Pagboto para sa iyong ballot ID, na nagsisilbing katibayan ng paglahok.

source: Need more help?
fil: Kailangan ng karagdagang tulong?

source: Contact the election administrator for additional support.
fil: Makipag-ugnayan sa administrator ng halalan para sa karagdagang suporta.

source: Contact Support
fil: Makipag-ugnayan sa Suporta
